app/controllers/ab_test_groups_controller.rb

SELECT "ab_test_groups".* FROM "ab_test_groups"
---
    def index
        ab_test_groups = AbTestGroup.all

INSERT INTO "ab_test_groups" ("group_name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["group_name", "group"], ["created_at", "2021-12-11 16:21:24.294522"], ["updated_at", "2021-12-11 16:21:24.294522"]]
---
    def create
        @ab_test_group = AbTestGroup.create(ab_test_group_params)

UPDATE "ab_test_groups" SET "group_name" = $1, "updated_at" = $2 WHERE "ab_test_groups"."id" = $3  [["group_name", "dabbashaed"], ["updated_at", "2021-12-11 14:44:51.257400"], ["id", 2]]
---
    def update
        if @ab_test_group.update(ab_test_group_params)

DELETE FROM "ab_test_groups" WHERE "ab_test_groups"."id" = $1  [["id", 6]]
---
    def destroy
        if @ab_test_group.destroy

SELECT "ab_test_groups".* FROM "ab_test_groups" WHERE "ab_test_groups"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
---
    def set_ab_test_group
        @ab_test_group = AbTestGroup.find(params[:id])