app/controllers/participants_controller.rb

    def index
        participants = Participant.all
---
SELECT "participants".* FROM "participants"

    def create
        @participant = Participant.create(participant_params)
---
INSERT INTO "participants" ("name", "ab_test_group_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "dabbas"], ["ab_test_group_id", 1], ["created_at", "2021-12-10 20:12:53.375077"], ["updated_at", "2021-12-10 20:12:53.375077"]]

    def update
        if @participant.update(participant_params)
---
UPDATE "participants" SET "name" = $1, "ab_test_group_id" = $2, "updated_at" = $3 WHERE "participants"."id" = $4  [["name", "wablabubd"], ["ab_test_group_id", 2], ["updated_at", "2021-12-10 20:14:30.760174"], ["id", 4]]

    def destroy
        if @participant.destroy
---
DELETE FROM "participants" WHERE "participants"."id" = $1  [["id", 6]]

    def add_by_group_name
        group_name = params[:group_name]
        name = params[:name]
        dob = params[:dob]
        group = AbTestGroup.find_by_group_name(group_name).first
        @participant = Participant.create(name: name, dob: dob, ab_test_group: group)
---
SELECT "ab_test_groups".* FROM "ab_test_groups" WHERE "ab_test_groups"."group_name" = $1 ORDER BY "ab_test_groups"."id" ASC LIMIT $2  [["group_name", "group"], ["LIMIT", 1]]
INSERT INTO "participants" ("name", "ab_test_group_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "because"], ["ab_test_group_id", 2], ["created_at", "2021-12-11 16:33:36.597732"], ["updated_at", "2021-12-11 16:33:36.597732"]]

    def set_participant
        @participant = Participant.find(params[:id])
---
SELECT "participants".* FROM "participants" WHERE "participants"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]